{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Evidence report listing implemented features and the files involved.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for reference.",
  "frontend/.env.example": "Example environment file defining variables for backend canister ID and optional IC network config.",
  "frontend/DEPLOYMENT_DRAFT_LINK.md": "Guide explaining deployment steps and how to verify the app’s shareable URL and canister ID resolution.",
  "frontend/index.css": "Base Tailwind layer defining OKLCH color variables and global theming utilities.",
  "frontend/index.html": "Root HTML file loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Entry component that renders the ValentineFlow.",
  "frontend/src/backend.did.ts": "Candid IDL factory defining an empty backend service.",
  "frontend/src/canisterId.ts": "Utility functions to resolve backend canister ID and network host from environment variables.",
  "frontend/src/features/valentine/components/BackgroundMusicControl.tsx": "Music control button handling playback, autoplay attempts, and audio load errors.",
  "frontend/src/features/valentine/components/EnvelopeLetter.tsx": "Envelope component triggering an unfold animation and notifying parent when opened.",
  "frontend/src/features/valentine/components/FallingHeartsLayer.tsx": "Renders animated falling heart elements driven by the useFallingHearts hook.",
  "frontend/src/features/valentine/components/ScratchHeart.tsx": "Canvas scratch-off component that initializes a gradient overlay and detects completion when enough area is scratched.",
  "frontend/src/features/valentine/components/ValentineBackNextControls.tsx": "Navigation buttons that move between previous and next Valentine flow screens.",
  "frontend/src/features/valentine/components/ValentineGif.tsx": "GIF display component with error fallback, keyboard accessibility, and optional click handling.",
  "frontend/src/features/valentine/components/ValentineLayout.tsx": "Centered card-style layout wrapper for Valentine screens.",
  "frontend/src/features/valentine/content/assets.ts": "Central asset list containing GIF URLs, local fallbacks, and music used across Valentine screens.",
  "frontend/src/features/valentine/content/flowOrder.ts": "Defines sequential screen flow and helpers to get previous and next screens.",
  "frontend/src/features/valentine/content/strings.ts": "All text and labels for Valentine UI, including quiz questions and fallback messages.",
  "frontend/src/features/valentine/effects/useCustomValentineGif.ts": "Hook to manage custom GIF URLs with validation, previewing, persistence, and reset.",
  "frontend/src/features/valentine/effects/useFallingHearts.ts": "Generates falling heart animations by spawning and removing heart objects over time.",
  "frontend/src/features/valentine/effects/useGlitterBurst.ts": "Creates a short glitter burst effect by generating temporary particle positions.",
  "frontend/src/features/valentine/effects/useKissBurst.ts": "Produces clustered kiss animations in timed bursts with automatic cleanup.",
  "frontend/src/features/valentine/effects/useKissPop.ts": "Triggers scattered kiss animations over a short period with timed cleanup.",
  "frontend/src/features/valentine/effects/useTypewriter.ts": "Typewriter effect hook that reveals text line by line and tracks completion.",
  "frontend/src/features/valentine/screens/ChooseYourGiftScreen.tsx": "Displays a list of four gift buttons with a GIF and handles navigation to each gift screen.",
  "frontend/src/features/valentine/screens/CongratulationsScreen.tsx": "Shows a congratulations message with a GIF and a button to navigate to the gifts screen.",
  "frontend/src/features/valentine/screens/CuddleHugScreen.tsx": "Shows a cuddle/hug-themed GIF and message with back/next navigation.",
  "frontend/src/features/valentine/screens/FinalSurpriseScreen.tsx": "Displays a final surprise GIF and clickable box that reveals a message with glitter burst effects.",
  "frontend/src/features/valentine/screens/Gift1QuestionScreen.tsx": "Implements a multi‑question quiz with feedback, GIFs, and navigation to the next gift when completed.",
  "frontend/src/features/valentine/screens/Gift2MessageScreen.tsx": "Shows a GIF and an envelope that opens to a typed love letter with a typewriter effect.",
  "frontend/src/features/valentine/screens/Gift3ImagesScreen.tsx": "Displays a memories‑themed GIF and message with a return‑to‑gifts button.",
  "frontend/src/features/valentine/screens/Gift4ScratchHeartScreen.tsx": "Provides a scratch‑off heart component that triggers kiss burst particles when completed.",
  "frontend/src/features/valentine/screens/SpinTheWheelOfLoveScreen.tsx": "Implements a spinning reward wheel with limited attempts, animation, and a summary of earned rewards.",
  "frontend/src/features/valentine/screens/SuccessScreen.tsx": "Empty placeholder file for a success screen.",
  "frontend/src/features/valentine/screens/WelcomeScreen.tsx": "Shows a welcome message with a GIF and button to begin the Valentine flow.",
  "frontend/src/features/valentine/screens/WillYouBeMyValentineScreen.tsx": "React screen showing a Valentine prompt with customizable GIF, dialog for entering a new GIF URL, and Yes/No buttons where No enlarges the Yes button.",
  "frontend/src/features/valentine/ValentineFlow.tsx": "Screen flow controller switching between all Valentine app screens with falling hearts and music.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, handling login, stored identities, and status tracking.",
  "frontend/src/index.css": "Global Tailwind CSS with Valentine-themed OKLCH colors plus custom components and animations like envelope/letter effects.",
  "frontend/src/main.tsx": "App entry point wiring React, React Query, Internet Identity provider, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and responsive settings using OKLCH variables.",
  "project_state.json": "JSON describing the project’s feature requirements, issues, and update plans for Valentine site interactions."
}