{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short summaries of their purpose.",
  "frontend/.env.example": "Example environment variable template including backend canister ID settings and optional network config.",
  "frontend/DEPLOYMENT_DRAFT_LINK.md": "Guide explaining deployment checks, canister ID resolution, and valid shareable URL format.",
  "frontend/index.css": "Global Tailwind-based theme definitions with OKLCH colors, dark mode values, and global styles.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "App entry component rendering the ValentineFlow.",
  "frontend/src/backend.did.ts": "Candid interface declaring an empty backend canister service.",
  "frontend/src/canisterId.ts": "Functions resolving backend canister ID and network host from environment variables.",
  "frontend/src/features/valentine/components/BackgroundMusicControl.tsx": "Autoplaying background music player with play/pause button UI.",
  "frontend/src/features/valentine/components/FallingHeartsLayer.tsx": "Renders falling heart emojis using the useFallingHearts hook.",
  "frontend/src/features/valentine/components/ValentineBackNextControls.tsx": "Back/next navigation buttons derived from flow order.",
  "frontend/src/features/valentine/components/ValentineGif.tsx": "GIF renderer with clickable behavior and fallback text on load failure.",
  "frontend/src/features/valentine/components/ValentineLayout.tsx": "Centered card-style layout wrapper for Valentine screens.",
  "frontend/src/features/valentine/content/assets.ts": "Centralized GIF URLs, fallback assets, quiz images, and music file paths.",
  "frontend/src/features/valentine/content/flowOrder.ts": "Defines sequential Valentine screen order with helpers for previous/next lookup.",
  "frontend/src/features/valentine/content/strings.ts": "Defines all static UI strings, quiz questions, and fallback labels used throughout the Valentine feature.",
  "frontend/src/features/valentine/effects/useCustomValentineGif.ts": "Custom hook for previewing, validating, applying, and storing a user-provided GIF URL with error handling.",
  "frontend/src/features/valentine/effects/useFallingHearts.ts": "Generates and manages timed falling heart animations with a maximum concurrent heart limit.",
  "frontend/src/features/valentine/effects/useGlitterBurst.ts": "Provides a particle burst effect triggered on demand, cleaning particles after a short animation.",
  "frontend/src/features/valentine/screens/ChooseYourGiftScreen.tsx": "Renders the gift selection screen with GIF preview and buttons to navigate to gift screens.",
  "frontend/src/features/valentine/screens/CongratulationsScreen.tsx": "Displays a congratulations message and GIF with navigation to the gift selection screen.",
  "frontend/src/features/valentine/screens/CuddleHugScreen.tsx": "Shows a cuddle/hug GIF and themed text with navigation controls.",
  "frontend/src/features/valentine/screens/FinalSurpriseScreen.tsx": "Displays the final surprise GIF, a clickable surprise box, an animated message reveal, and glitter burst effect.",
  "frontend/src/features/valentine/screens/Gift1QuestionScreen.tsx": "Implements the quiz flow for Gift 1 with GIFs, answer validation, and progression between questions.",
  "frontend/src/features/valentine/screens/Gift2MessageScreen.tsx": "Shows a series of affectionate messages with a themed GIF and navigation back to gifts.",
  "frontend/src/features/valentine/screens/Gift3ImagesScreen.tsx": "Displays a memories-themed GIF and message block with navigation back to gifts.",
  "frontend/src/features/valentine/screens/SuccessScreen.tsx": "Empty file; no implementation provided.",
  "frontend/src/features/valentine/screens/WelcomeScreen.tsx": "Renders the Valentine welcome screen with title, message, GIF, continue button, and navigation controls.",
  "frontend/src/features/valentine/screens/WillYouBeMyValentineScreen.tsx": "Displays the main Valentine prompt with customizable GIF, yes/no interactions, and navigation to the next screen.",
  "frontend/src/features/valentine/ValentineFlow.tsx": "Main navigation controller switching between Valentine screens with hearts and music layers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, auto‑refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, stored identity restoration, and status tracking.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, gradients, and custom Valentine-themed component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring QueryClient and InternetIdentityProvider around the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugin usage.",
  "project_state.json": "Describes the project state, issues, and requirements for redeploying with a new valid IC canister ID."
}