{
  "kind": "build_request",
  "title": "Create a brand-new IC canister and redeploy to fix “Canister ID Not Resolved”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a brand-new Internet Computer canister (do not reuse the existing/invalid canister ID) and redeploy the full app so the resulting public URL resolves successfully (no ICP gateway “Canister ID Not Resolved” / Error 400) and can be shared as a working draft link.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Create a new brand new canister",
          "You are mad 😡 just give me my draft link to share to my partner and that's enough",
          "Opening the shared app URL returns “Canister ID Not Resolved”; requires creating a brand-new canister and redeploying to get a valid URL."
        ]
      },
      "acceptanceCriteria": [
        "A fresh canister ID is created and used for the deployment (the previous broken canister ID is not referenced).",
        "The deployed URL loads the frontend successfully in a browser without showing “Canister ID Not Resolved” / Error 400.",
        "A shareable URL is produced that includes a valid canister subdomain (e.g., https://<canister-id>.icp0.io/) and works when opened on another device/network."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix frontend backend-canister-ID resolution so it reliably reads the deployed backend canister ID from env.json and/or Vite environment variables without TypeScript/runtime errors, ensuring the deployed frontend always points at the newly created backend canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "This will be automatically set during deployment",
          "Opening the shared app URL returns “Canister ID Not Resolved”"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/canisterId.ts no longer uses `await` in a non-async function; canister ID resolution compiles and runs correctly.",
        "When env.json is present at /env.json, the frontend uses BACKEND_CANISTER_ID from that file; otherwise it falls back to VITE_BACKEND_CANISTER_ID or VITE_CANISTER_ID_BACKEND.",
        "If no canister ID is available, the app fails gracefully with clear console output rather than a hard crash."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no multi-canister backend architecture).",
    "Do not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new Valentine app features or changing existing Valentine flow content beyond what is required for deployment/canister-ID correctness.",
    "Integrating third-party auth providers (only Internet Identity is supported).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Obtain a working shareable draft/public URL for the deployed app by recreating the canister and redeploying."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [
      "Current shared URL shows ICP gateway Error 400: “Canister ID Not Resolved” and must be fixed via a fresh canister ID + redeploy."
    ],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}