{
  "kind": "build_request",
  "title": "Add Back/Next navigation controls and display a GIF on every Valentine screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Add persistent \"Back\" and \"Next\" navigation controls below the main content on every Valentine flow screen (Welcome, Will You Be My Valentine, Choose Your Gift, Gift 1 Quiz, Gift 2 Message, Gift 3 Images, Success) so users can move sequentially through the screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "You also have to put back and next option in each page below"
        ]
      },
      "acceptanceCriteria": [
        "Each screen renders a clearly visible Back and Next control positioned below the main content area (within the same centered layout/card).",
        "Back/Next labels are in English and use centralized string constants (no hardcoded button text scattered across screens).",
        "Back/Next navigation works without breaking existing per-screen actions (e.g., Gift buttons on the gifts screen, Yes/No actions on the Valentine screen, quiz answer behavior on Gift 1).",
        "Sequential navigation order is consistent across the entire flow: Welcome → Will You Be My Valentine → Choose Your Gift → Gift 1 → Gift 2 → Gift 3 → Success (Back goes in reverse order)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Display a GIF on every Valentine flow screen, including screens that currently do not show a GIF (Choose Your Gift, Gift 1 Quiz, Gift 3 Images, Success), using the existing asset pipeline and safe fallback behavior if a GIF fails to load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and add gif in each page"
        ]
      },
      "acceptanceCriteria": [
        "Every screen in the flow renders at least one GIF element (Welcome, Will You Be My Valentine, Choose Your Gift, Gift 1, Gift 2, Gift 3, Success).",
        "For screens that already include a GIF (Welcome, Will You Be My Valentine, Gift 2), the GIF remains present after changes.",
        "For screens that newly add a GIF, the GIF uses existing ASSETS entries (e.g., ASSETS.bubuDudu and/or the existing Tenor GIF URLs) and includes an English alt text.",
        "If a GIF fails to load, the UI degrades gracefully (e.g., fallback container/text) without layout breakage."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the centralized strings module to include any new English user-facing text introduced by the Back/Next controls and any new GIF fallback labels used on newly updated screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "New button labels and fallback labels are added to frontend/src/features/valentine/content/strings.ts and referenced from screens via STRINGS.",
        "All new user-facing text added for this change is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components); compose them as-is.",
    "Do not edit any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Backend remains a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change or remove the falling-hearts animation.",
    "Do not change or remove background music behavior.",
    "Do not redesign the overall Valentine theme beyond what is necessary to place the Back/Next controls and add GIFs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}