{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend canister ID resolution for reliable IC redeploy/shareable URL",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the frontend build/deploy process does not reference any previous broken canister ID and provides clear redeploy guidance for producing a fresh, shareable IC URL.",
      "acceptanceCriteria": [
        "A fresh canister ID is created and used for the deployment (the previous broken canister ID is not referenced).",
        "The deployed URL loads the frontend successfully in a browser without showing “Canister ID Not Resolved” / Error 400.",
        "A shareable URL is produced that includes a valid canister subdomain (e.g., https://<canister-id>.icp0.io/) and works when opened on another device/network."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_DRAFT_LINK.md",
          "operation": "create",
          "description": "Add a short redeploy checklist focused on producing a fresh canister ID and ensuring the frontend is configured to read the new ID at runtime (e.g., via /env.json and Vite env vars), so the shared URL resolves. Reference the app’s runtime canister-id resolution behavior and where to verify it after redeploy."
        },
        {
          "path": "frontend/.env.example",
          "operation": "modify",
          "description": "Clarify the intended env var names and that values must come from the newly created deployment (do not paste/keep any previously broken canister ID). Keep user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make frontend backend-canister-ID resolution robust by correctly loading BACKEND_CANISTER_ID from /env.json with Vite env var fallbacks, avoiding TypeScript/runtime errors and failing gracefully when missing.",
      "acceptanceCriteria": [
        "frontend/src/canisterId.ts no longer uses `await` in a non-async function; canister ID resolution compiles and runs correctly.",
        "When env.json is present at /env.json, the frontend uses BACKEND_CANISTER_ID from that file; otherwise it falls back to VITE_BACKEND_CANISTER_ID or VITE_CANISTER_ID_BACKEND.",
        "If no canister ID is available, the app fails gracefully with clear console output rather than a hard crash."
      ],
      "file_operations": [
        {
          "path": "frontend/src/canisterId.ts",
          "operation": "modify",
          "description": "Refactor canister ID resolution to eliminate `await` in non-async functions by introducing an async initialization/loader for /env.json and a safe synchronous accessor that uses cached values and Vite env var fallbacks. Add clear console warnings/errors when no ID is available, without throwing uncaught errors at module-evaluation time."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Initialize runtime configuration early (before app render) so /env.json can be read when available and cached for later synchronous access. Ensure missing config does not hard-crash the app; leave clear console output for debugging redeploys."
        },
        {
          "path": "frontend/src/config.ts",
          "operation": "modify",
          "description": "Update the core configuration loader (provided by the core-infrastructure component) to use the improved canister-id resolution behavior, ensuring actor/config creation consistently points to the newly deployed backend canister. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Add a guard so actor creation does not proceed when the backend canister ID is missing/empty; instead return a null actor state and log a clear console message. This prevents runtime crashes and makes misconfiguration obvious after deployment."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Ensure config loading for Internet Identity initialization remains compatible with the updated runtime config/canister-id loading (e.g., handle config-load errors gracefully and avoid cascading failures when canister ID is temporarily unavailable)."
        }
      ]
    }
  ]
}